## Data Manipulation with Pandas

pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

n this lab, you will learn how to manipulate data with Pandas. Here is an overview:

1. Basics of Pandas for data manipulation:
 - A. Series and DataFrames
 - B. Data Indexing and Selection, and Iteration
 - C. Dealing with Missing data
 - D. Basic operations and Functions
 - E. Aggregation Methods
 - F. Groupby
 - G. Merging, Joining and Concatenate
 - H. Beyond Dataframes: Working with CSV, and Excel


2. Real World Exploratory Data Analysis (EDA)

## 1. Pandas Basics for Data Manipulation

### A. Series and DataFrames

Both series and DataFrames are Pandas Data structures.

Series is like one dimensional NumPy array with axis labels.

DataFrame is multidimensional NumPy array with labels on rows and columns.

Working with NumPy, we saw that it supports numeric type data. Pandas on other hand supports whole range of data types, from numeric to strings, etc..

Since we are using python notebook, we do not need to install Pandas. We only just have to import it.

import pandas as pd

In [1]:
# importing numpy and pandas

import numpy as np
import pandas as pd

## Creating Series

Series can be created from a Python list, dictionary, and NumPy array.

In [3]:
# Creating the series from a Python list

my_list = [1,2,3,4]

pd.Series(my_list)

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
# Creating series with custom index
week_days = ['Mon','Tues','Wed','Thur','Fri']

pd.Series(week_days, index=["a", "b", "c", "d", "e"])

a     Mon
b    Tues
c     Wed
d    Thur
e     Fri
dtype: object

In [6]:
# Creating pandas series from python dictionary

my_dict = {1: 'India',
          2: 'USA',
          3: 'UK',
          4: 'Croatia',
          5: 'Argentina',
          6: 'France',
          7: 'Germany'}

pd.Series(my_dict)

1        India
2          USA
3           UK
4      Croatia
5    Argentina
6       France
7      Germany
dtype: object

In [7]:
# another example

pd.Series({1:2,2:3,3:4})

1    2
2    3
3    4
dtype: int64

In [8]:
# Creating the Series from NumPy array
# We peovide the list of indexes
# if we don't provide the indexes, the default indexes are numbers...starts from 0,1,2..

my_array = np.array([1,2,3])

pd.Series(my_array)

0    1
1    2
2    3
dtype: int32

In [10]:
# Series with index

pd.Series(my_array, index=["a","b","c"])

a    1
b    2
c    3
dtype: int32

## Creating DataFrames

DataFrames are the most used Pandas data structure. It can be created from a dictionary, 2D array, and Series.

In [39]:
# Creating a pandas DataFrame from a python dictionary

my_players = {'Country': ["Argentina", "France", "Croatia", "Morocco", "Poland"],
             'Name': ["Messi", "Mbappe", "Modric", "Ziyech", "Lewy"]}

my_players_df = pd.DataFrame(my_players)

In [16]:
pd.DataFrame(my_players, index=["a","b","c","d","e"])

     Country    Name
a  Argentina   Messi
b     France  Mbappe
c    Croatia  Modric
d    Morocco  Ziyech
e     Poland    Lewy

In [21]:
# Creating a dataframe from a 2D array
# You pass the list of columns while creating the dataframe

my_2d_array = np.array(([1,2,3],[4,5,6],[7,8,9]))

pd.DataFrame(my_2d_array, columns = ["column_1", "column_2", "column_3"], index=["a","b","c"])

   column_1  column_2  column_3
a         1         2         3
b         4         5         6
c         7         8         9

In [33]:
# Creating a dataframe from Pandas series 
# Pass the columns in a list

my_series = pd.Series((1,7,8,9))

In [35]:
pd.DataFrame(my_series, columns=["column_1"])

   column_1
0         1
1         7
2         8
3         9

In [40]:
# Adding a column
my_players_df['Rating'] = ["*****","*****","****","***","**"]

In [41]:
my_players_df

     Country    Name Rating
0  Argentina   Messi  *****
1     France  Mbappe  *****
2    Croatia  Modric   ****
3    Morocco  Ziyech    ***
4     Poland    Lewy     **

In [45]:
## Drop a column from pandas dataframe

my_players_df.drop(['Rating'],axis=1, inplace=True)

In [47]:
my_players_df.index

RangeIndex(start=0, stop=5, step=1)

## B. Data Indexing, Selection and Iteration

Indexing and selection works in both Series and Dataframe.

Because DataFrame is made of Series, let's focus on how to select data in DataFrame.

In [48]:
# Creating DataFrame from a dictionary

countries = {'Name': ['USA', 'India', 'German', 'Rwanda'], 
             
             'Codes':[1, 91, 49, 250] }

df = pd.DataFrame(countries, index=['a', 'b', 'c', 'd'])
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [49]:
## Select a column from dataframe

df['Codes']

a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [51]:
## Another way

df.Codes

a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [52]:
## When there are multiple columns that need to be selected, include the columns in a liist

df [['Name', 'Codes']]

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [53]:
# This will return the first two rows
df [0:2]

    Name  Codes
a    USA      1
b  India     91

You can also use loc to select data by the label indexes and iloc to select by default integer index (or by the position of the row)

In [56]:
df.loc['a']

Name     USA
Codes      1
Name: a, dtype: object

In [60]:
df.loc['a':'d']

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [61]:
df.iloc[3]

Name     Rwanda
Codes       250
Name: d, dtype: object

In [62]:
df.iloc[1:3]

     Name  Codes
b   India     91
c  German     49

## Conditional Selection

In [63]:
df

     Name  Codes
a     USA      1
b   India     91
c  German     49
d  Rwanda    250

In [64]:
#Let's select a country with code 49

df[df['Codes']==49]

     Name  Codes
c  German     49

In [65]:
#Let's select a country with code less than 250
df[df['Codes'] < 250]

     Name  Codes
a     USA      1
b   India     91
c  German     49

In [66]:
# Let's select the country with name "USA"

df[df['Name']=='USA']

  Name  Codes
a  USA      1

In [68]:
# You can use and (&) or (|) for more than conditions
#df [(condition 1) & (condition 2)]

df[(df['Codes'] > 1) & (df['Codes'] < 250)]

     Name  Codes
b   India     91
c  German     49

In [69]:
df [(df['Codes'] == 91 ) & (df['Name'] == 'India') ]

    Name  Codes
b  India     91

You can also use isin() and where() to select data in a series or dataframe.

In [70]:
# isin() return false or true when provided value is included in dataframe
sample_codes_names=[1,3,250, 'USA', 'India', 'England']

df.isin(sample_codes_names)

    Name  Codes
a   True   True
b   True  False
c  False  False
d  False   True

In [72]:
df[df.isin(sample_codes_names)]

    Name  Codes
a    USA    1.0
b  India    NaN
c    NaN    NaN
d    NaN  250.0

As you can see, it returned True wherever a country code or name was found. Otherwise, False. You can use a dictinary to match search by columns. A key must be a column and values are passed in list.

In [73]:
sample_codes_v2 = {'Name':['India','China','Croatia'],'Codes':[100, 1, 250,7]}
df.isin(sample_codes_v2)

    Name  Codes
a  False   True
b   True  False
c  False  False
d  False   True

In [82]:
df2 = pd.DataFrame(np.array ([[1,2,3], [4,5,6], [7,8,9]]), 
                   columns = ['column 1', 'column 2', 'column 3'])

df2

   column 1  column 2  column 3
0         1         2         3
1         4         5         6
2         7         8         9

In [76]:
df2.isin([1,7,22,42,6])

   column 1  column 2  column 3
0      True     False     False
1     False     False      True
2      True     False     False

In [77]:
df2[df2>4]

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

In [78]:
df2.where(df2 > 4)

   column 1  column 2  column 3
0       NaN       NaN       NaN
1       NaN       5.0       6.0
2       7.0       8.0       9.0

where allows you to replace the values that doesn't meet the provided condition with any other value. So, if we do df2.where(df2 > 4, 0) as follows, all values less than 4 will be replaced by 0.

In [83]:
df2.where(df2 > 4, 0)

   column 1  column 2  column 3
0         0         0         0
1         0         5         6
2         7         8         9

In [85]:
## we can achieve the above operation by

## NOTE: This operation does an inplace updation, whereas df.where command will not do inplace updation

df2[df2 > 4] = 0

In [86]:
df2

   column 1  column 2  column 3
0         1         2         3
1         4         0         0
2         0         0         0

## Iteration

* df.items() #Iterate over (column name, Series) pairs.
* df.iteritems() Iterate over (column name, Series) pairs.
* DataFrame.iterrows() Iterate over DataFrame rows as (index, Series) pairs.
* DataFrame.itertuples([index, name]) Iterate over DataFrame rows as namedtuples.

In [87]:
# Iterate over (column name, series) pairs using df.items

for column_name, data in df.items():
    print(column_name)
    print(data)

Name
a       USA
b     India
c    German
d    Rwanda
Name: Name, dtype: object
Codes
a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [88]:
# Iterate over (column name, Series) pairs using df.iteritems()
# Same as df.items()

for column_name, data in df.iteritems():
    print(column_name)
    print(data)

Name
a       USA
b     India
c    German
d    Rwanda
Name: Name, dtype: object
Codes
a      1
b     91
c     49
d    250
Name: Codes, dtype: int64

In [89]:
# Iterate over DataFrame rows as (index, Series) pairs using df.iterrows()

for row in df.iterrows():
    print(row)

('a', Name     USA
Codes      1
Name: a, dtype: object)
('b', Name     India
Codes       91
Name: b, dtype: object)
('c', Name     German
Codes        49
Name: c, dtype: object)
('d', Name     Rwanda
Codes       250
Name: d, dtype: object)

In [90]:
# Iterate over DataFrame rows as namedtuples using df.itertuples()

for row in df.itertuples():
    print(row)

Pandas(Index='a', Name='USA', Codes=1)
Pandas(Index='b', Name='India', Codes=91)
Pandas(Index='c', Name='German', Codes=49)
Pandas(Index='d', Name='Rwanda', Codes=250)

## C. Dealing with Missing data

Real world datasets are messy, often with missing values. Pandas replace NaN with missing values by default. NaN stands for not a number.

Missing values can either be ignored, droped or filled.

In [91]:
# Creating a dataframe

df3 = pd.DataFrame(np.array ([[1,2,3], [4,np.nan,6], [7,np.nan,np.nan]]), 
                   columns = ['column 1', 'column 2', 'column 3'])

### Checking Missing values

In [92]:
# Recognizing the missing values

df3.isnull()

   column 1  column 2  column 3
0     False     False     False
1     False      True     False
2     False      True      True

In [93]:
# Calculating number of the missing values in each feature

df3.isnull().sum()

column 1    0
column 2    2
column 3    1
dtype: int64

In [94]:
# Recognizng non missig values

df3.notna()

   column 1  column 2  column 3
0      True      True      True
1      True     False      True
2      True     False     False

In [95]:
# Calculating number of non missing values in each feature

df3.notna().sum()

column 1    3
column 2    1
column 3    2
dtype: int64

### Removing the missing values

In [96]:
## Dropping missing values 

df3.dropna()

   column 1  column 2  column 3
0       1.0       2.0       3.0

All rows are deleted because dropna() will remove each row which have missing value.

In [97]:
# you can drop NaNs in specific column(s)

df3['column 3'].dropna()

0    3.0
1    6.0
Name: column 3, dtype: float64

In [98]:
df3

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       NaN       6.0
2       7.0       NaN       NaN

In [102]:
# You can drop data by axis 
# Axis = 1...drop all columns with Nans
# df3.dropna(axis='columns')

df3.dropna(axis=1)

   column 1
0       1.0
1       4.0
2       7.0

In [103]:
# axis = 0...drop all rows with Nans
# df3.dropna(axis='rows') is same 

df3.dropna(axis=0)

   column 1  column 2  column 3
0       1.0       2.0       3.0

Filling the missing values

In [104]:
# Filling Missing values

df3.fillna(10)

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0      10.0       6.0
2       7.0      10.0      10.0

In [105]:
df3.fillna('fillme')

   column 1 column 2 column 3
0       1.0        2        3
1       4.0   fillme        6
2       7.0   fillme   fillme

In [106]:
# You can forward fill (ffill) or backward fill(bfill)
# Or fill a current value with previous or next value

df3.fillna(method='ffill')

   column 1  column 2  column 3
0       1.0       2.0       3.0
1       4.0       2.0       6.0
2       7.0       2.0       6.0

In [110]:
df4 = pd.DataFrame({'column 1':[np.nan,3.0,5.0],'column 2':[6.0,np.nan,1.0],'Column 3':[np.nan,6.0,7.0]})

In [111]:
# Won't change it because the last values are NaNs, so it backward it

df4.fillna(method='bfill')

   column 1  column 2  Column 3
0       3.0       6.0       6.0
1       3.0       1.0       6.0
2       5.0       1.0       7.0

## D. More Operations and Functions

This section will show the more and most useful functions of Pandas.

In [112]:
df5 = pd.DataFrame({'Product Name':['Football','Cricket Bat','Hockey Stick'],
                   'Price': [299, 499, 599],
                   'Quantity': [20, 15, 10],
                   'Id': [11, 12, 13]})

In [113]:
## Getting the summary of dataframe

df5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Product Name  3 non-null      object
 1   Price         3 non-null      int64
 2   Quantity      3 non-null      int64
 3   Id            3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [114]:
# Return dataframe columns

df5.columns

Index(['Product Name', 'Price', 'Quantity', 'Id'], dtype='object')

In [115]:
# Return dataframe column using keys

df5.keys()

Index(['Product Name', 'Price', 'Quantity', 'Id'], dtype='object')

In [117]:
# # Return the head of the dataframe ....could make sense if you have long data frame
# Choose how many rows you want in head()

df5.head(2)

  Product Name  Price  Quantity  Id
0     Football    299        20  11
1  Cricket Bat    499        15  12

In [118]:
df5.head(1)

  Product Name  Price  Quantity  Id
0     Football    299        20  11

In [119]:
# Return the tail of the dataframe

df5.tail(1)

   Product Name  Price  Quantity  Id
2  Hockey Stick    599        10  13

In [122]:
# Return NumPy array of the dataframe

df5.values

array([['Football', 299, 20, 11],
       ['Cricket Bat', 499, 15, 12],
       ['Hockey Stick', 599, 10, 13]], dtype=object)

In [123]:
# Return the size or number of elements in a dataframe

df5.size

12

In [124]:
# Returns the shape of the dataframe

df5.shape

(3, 4)

In [125]:
# Return the length of the dataframe/the number of rows in a dataframe

df5.shape[0]

3

In [126]:
# Return the length of the dataframe/the number of columns in a dataframe

df5.shape[1]

4

### Unique Values

In [129]:
# Return unique values in a given column 

df5['Product Name'].unique()

array(['Football', 'Cricket Bat', 'Hockey Stick'], dtype=object)

In [130]:
# Return a number of unique values

df5['Product Name'].nunique()

3

In [131]:
# Counting the occurence of each value in a column 

df5['Product Name'].value_counts()

Cricket Bat     1
Football        1
Hockey Stick    1
Name: Product Name, dtype: int64

### Applying a Function to Dataframe

In [132]:
## create a function using def function_name(function_arguments):

def product_multiply(x):
    return x*x

In [133]:
# Call the function to multiple quantity

product_multiply(df5['Quantity'])

0    400
1    225
2    100
Name: Quantity, dtype: int64

In [134]:
# Another way to use the above function

df5['Quantity'].apply(product_multiply)

0    400
1    225
2    100
Name: Quantity, dtype: int64

In [137]:
df6 = pd.DataFrame(([1,2,3],[4,5,6]),columns=['col1','col2','col3'])

In [138]:
# You can also apply an anonymous function to a dataframe
# Squaring each value in dataframe
# Use applymap to apply the operation on the entire dataframe. This won't work on Series objects

df6.applymap(lambda x: x*x)

   col1  col2  col3
0     1     4     9
1    16    25    36

### Sorting values in dataframe

In [139]:
# Sort the df4 by the order number

df5.sort_values(['Price'])

   Product Name  Price  Quantity  Id
0      Football    299        20  11
1   Cricket Bat    499        15  12
2  Hockey Stick    599        10  13

In [140]:
# Sort the df4 by the order number in descending order

df5.sort_values(['Price'],ascending=False)

   Product Name  Price  Quantity  Id
2  Hockey Stick    599        10  13
1   Cricket Bat    499        15  12
0      Football    299        20  11

## E. Aggregation Methods

In [141]:
df5

   Product Name  Price  Quantity  Id
0      Football    299        20  11
1   Cricket Bat    499        15  12
2  Hockey Stick    599        10  13

In [142]:
# Summary statistics

df5.describe()

            Price  Quantity    Id
count    3.000000       3.0   3.0
mean   465.666667      15.0  12.0
std    152.752523       5.0   1.0
min    299.000000      10.0  11.0
25%    399.000000      12.5  11.5
50%    499.000000      15.0  12.0
75%    549.000000      17.5  12.5
max    599.000000      20.0  13.0

In [143]:
df5.describe().transpose()

          count        mean         std    min    25%    50%    75%    max
Price       3.0  465.666667  152.752523  299.0  399.0  499.0  549.0  599.0
Quantity    3.0   15.000000    5.000000   10.0   12.5   15.0   17.5   20.0
Id          3.0   12.000000    1.000000   11.0   11.5   12.0   12.5   13.0

In [145]:
# Mode of the dataframe
# Mode is the most recurring values

df5['Quantity'].mode()

0    10
1    15
2    20
dtype: int64

In [146]:
# Find the mean of the dataframe column

df5['Quantity'].mean()

15.0

In [147]:
# Find the minimum value

df5['Price'].min()

299

In [148]:
# find the maximum value

df5['Price'].max()

599

In [149]:
# Find the median value

df5['Price'].median()

499.0

In [150]:
# Find the standard deviation

df5['Price'].std()

152.75252316519467

In [151]:
# Find the variance

df5['Price'].var()

23333.333333333336

In [152]:
152.75252316519467 ** 2

23333.333333333336

In [153]:
# Sum of all values in a column

df5['Price'].sum()

1397

In [154]:
# Product of all values in dataframe

df5['Price'].prod()

89371399

## F. Groupby

Group by involves splitting data into groups, applying function to each group, and combining the results.

In [155]:
df6 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag', 'Ankle', 'Pullover', 'Boot', 'Ankle', 'Tshirt', 'Shirt'], 
              'Order Number':[45,56,64, 34, 67, 56, 34, 89, 45], 
              'Total Quantity':[10,5,9, 11, 11, 8, 14, 23, 10]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

In [156]:
df6

  Product Name  Order Number  Total Quantity
0        Shirt            45              10
1         Boot            56               5
2          Bag            64               9
3        Ankle            34              11
4     Pullover            67              11
5         Boot            56               8
6        Ankle            34              14
7       Tshirt            89              23
8        Shirt            45              10

In [157]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Product Name    9 non-null      object
 1   Order Number    9 non-null      int64
 2   Total Quantity  9 non-null      int64
dtypes: int64(2), object(1)
memory usage: 344.0+ bytes

In [158]:
df6.describe()

       Order Number  Total Quantity
count      9.000000        9.000000
mean      54.444444       11.222222
std       17.543596        5.044249
min       34.000000        5.000000
25%       45.000000        9.000000
50%       56.000000       10.000000
75%       64.000000       11.000000
max       89.000000       23.000000

In [159]:
# Let's group the df by product name

df6.groupby(['Product Name']).mean()

              Order Number  Total Quantity
Product Name
Ankle                 34.0            12.5
Bag                   64.0             9.0
Boot                  56.0             6.5
Pullover              67.0            11.0
Shirt                 45.0            10.0
Tshirt                89.0            23.0

In [162]:
df6.groupby(['Product Name']).sum()

              Order Number  Total Quantity
Product Name
Ankle                   68              25
Bag                     64               9
Boot                   112              13
Pullover                67              11
Shirt                   90              20
Tshirt                  89              23

In [163]:
df6.groupby(['Product Name']).min()

              Order Number  Total Quantity
Product Name
Ankle                   34              11
Bag                     64               9
Boot                    56               5
Pullover                67              11
Shirt                   45              10
Tshirt                  89              23

In [164]:
df6.groupby(['Product Name']).max()

              Order Number  Total Quantity
Product Name
Ankle                   34              14
Bag                     64               9
Boot                    56               8
Pullover                67              11
Shirt                   45              10
Tshirt                  89              23

In [165]:
df7 = pd.DataFrame({'Product Name':['Shirt','Boot','Bag', 'Ankle', 'Pullover', 'Boot', 'Ankle', 'Tshirt', 'Shirt'], 
              'Order Number':[45,56,64, 34, 67, 56, 34, 89, 55], 
              'Total Quantity':[10,5,9, 11, 11, 8, 14, 23, 5]}, 
              columns = ['Product Name', 'Order Number', 'Total Quantity'])

In [168]:
df6.groupby(['Product Name', 'Order Number']).max()

                           Total Quantity
Product Name Order Number
Ankle        34                        14
Bag          64                         9
Boot         56                         8
Pullover     67                        11
Shirt        45                        10
Tshirt       89                        23

In [171]:
df7.groupby(['Product Name', 'Order Number']).max()

                           Total Quantity
Product Name Order Number
Ankle        34                        14
Bag          64                         9
Boot         56                         8
Pullover     67                        11
Shirt        45                        10
             55                         5
Tshirt       89                        23

In [172]:
df7.groupby(['Product Name', 'Order Number']).sum()

                           Total Quantity
Product Name Order Number
Ankle        34                        25
Bag          64                         9
Boot         56                        13
Pullover     67                        11
Shirt        45                        10
             55                         5
Tshirt       89                        23

You can also use aggregation() after groupby.

In [173]:
df7.groupby(['Product Name']).aggregate(['min','max','sum'])

             Order Number          Total Quantity
                      min max  sum            min max sum
Product Name
Ankle                  34  34   68             11  14  25
Bag                    64  64   64              9   9   9
Boot                   56  56  112              5   8  13
Pullover               67  67   67             11  11  11
Shirt                  45  55  100              5  10  15
Tshirt                 89  89   89             23  23  23

In [174]:
df7.groupby(['Product Name']).aggregate(['sum'])

             Order Number Total Quantity
                      sum            sum
Product Name
Ankle                  68             25
Bag                    64              9
Boot                  112             13
Pullover               67             11
Shirt                 100             15
Tshirt                 89             23

## G. Combining Datasets: Concatenating, Joining and Merging

### Concatenation

In [190]:
# Creating dataframes

df1 = pd.DataFrame({'Col1':['A','B','C'],
                   'Col2':[1,2,3]}, 
                   index=['a','b','c'])

df2 = pd.DataFrame({'Col1':['D','E','F'],
                   'Col2':[4,5,6]}, 
                   index=['d','e','f'])


df3 = pd.DataFrame({'Col1':['G','I','J'],
                   'Col2':[7,8,9]}, 
                   index=['g', 'i','j'])

In [176]:
df1

  Col1  Col2
a    A     1
b    B     2
c    C     3

In [177]:
df2

  Col1  Col2
d    D     4
e    E     5
f    F     6

In [178]:
df3

  Col1  Col2
g    G     7
i    I     8
j    J     9

In [192]:
# Concatenating: Adding one dataset to another

pd.concat([df1, df2, df3])

  Col1  Col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

The default axis is 0. This is how the combined dataframes will look like if we change the axis to 1.

In [193]:
pd.concat([df1, df2, df3],axis=1)

  Col1  Col2 Col1  Col2 Col1  Col2
a    A   1.0  NaN   NaN  NaN   NaN
b    B   2.0  NaN   NaN  NaN   NaN
c    C   3.0  NaN   NaN  NaN   NaN
d  NaN   NaN    D   4.0  NaN   NaN
e  NaN   NaN    E   5.0  NaN   NaN
f  NaN   NaN    F   6.0  NaN   NaN
g  NaN   NaN  NaN   NaN    G   7.0
i  NaN   NaN  NaN   NaN    I   8.0
j  NaN   NaN  NaN   NaN    J   9.0

In [194]:
# We can also use append()

df1.append([df2,df3])

  Col1  Col2
a    A     1
b    B     2
c    C     3
d    D     4
e    E     5
f    F     6
g    G     7
i    I     8
j    J     9

### Merging

Merging
If you have worked with SQL, what pd.merge() does may be familiar. It links data from different sources (different features) and you have a control on the structure of the combined dataset.

Pandas Merge method(how): SQL Join Name : Description

* left : LEFT OUTER JOIN : Use keys or columns from left frame only

* right : RIGHT OUTER JOIN : Use keys or columns from right frame only

* outer : FULL OUTER JOIN : Use union of keys or columns from both frames

* inner : INNER JOIN : Use intersection of keys or columns from both frames

In [195]:
df1 = pd.DataFrame({'Name': ['Joe', 'Joshua', 'Jeanne', 'David'],
                        'Role': ['Manager', 'Developer', 'Engineer', 'Scientist']})

df2 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'Year Hired': [2018, 2017, 2020, 2018]})

df3 = pd.DataFrame({'Name': ['David', 'Joshua', 'Joe', 'Jeanne'],
'No of Leaves': [15, 3, 10, 12]})

In [196]:
df1

     Name       Role
0     Joe    Manager
1  Joshua  Developer
2  Jeanne   Engineer
3   David  Scientist

In [197]:
df2

     Name  Year Hired
0   David        2018
1  Joshua        2017
2     Joe        2020
3  Jeanne        2018

In [198]:
df3

     Name  No of Leaves
0   David            15
1  Joshua             3
2     Joe            10
3  Jeanne            12

In [204]:
## Let's merge on Role being a key 

pd.merge(df1, df2, how='inner', on='Name')

     Name       Role  Year Hired
0     Joe    Manager        2020
1  Joshua  Developer        2017
2  Jeanne   Engineer        2018
3   David  Scientist        2018

In [206]:
df1 = pd.DataFrame({'col1': ['K0', 'K0', 'K1', 'K2'],
                     'col2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
df2 = pd.DataFrame({'col1': ['K0', 'K1', 'K1', 'K2'],
                               'col2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [207]:
df1

  col1 col2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [208]:
df2

  col1 col2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [210]:
## Inner join on two dataframes

pd.merge(df1,df2,on=['col1','col2'],how='inner')

  col1 col2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [211]:
## Outer join

pd.merge(df1, df2, on=['col1','col2'], how='outer')

  col1 col2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [213]:
## Left join

pd.merge(df1, df2, on=['col1','col2'], how='left')

  col1 col2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [214]:
## right join

pd.merge(df1, df2, on=['col1','col2'], how='right')

  col1 col2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

### Joining

Joining is a simple way to combine columns of two dataframes with different indexes.

In [215]:
df1 = pd.DataFrame({'Col1': ['A', 'B', 'C'],
                     'Col2': [11, 12, 13]},
                      index=['a', 'b', 'c']) 

df2 = pd.DataFrame({'Col3': ['D', 'E', 'F'],
                    'Col4': [14, 14, 16]},
                      index=['a', 'c', 'd'])

In [216]:
df1

  Col1  Col2
a    A    11
b    B    12
c    C    13

In [217]:
df2

  Col3  Col4
a    D    14
c    E    14
d    F    16

In [218]:
df1.join(df2)

  Col1  Col2 Col3  Col4
a    A    11    D  14.0
b    B    12  NaN   NaN
c    C    13    E  14.0

You can see that with df.join(), the alignment of data is on indexes.

In [219]:
df1.join(df2, how='outer')

  Col1  Col2 Col3  Col4
a    A  11.0    D  14.0
b    B  12.0  NaN   NaN
c    C  13.0    E  14.0
d  NaN   NaN    F  16.0

In [220]:
df1.join(df2, how='inner')

  Col1  Col2 Col3  Col4
a    A    11    D    14
c    C    13    E    14

Learn more about Merging, Joining, and Concatenating the Pandas Dataframes [here](https://pandas.pydata.org/docs/user_guide/merging.html).

## H. Beyond Dataframes: Working with CSV and Excel

In this last section of Pandas' fundamentals, we will see how to read real world data with different formats: CSV and Excel

### CSV and Excel

Let's use california housing dataset.

In [222]:
data = pd.read_csv('housing.csv')

In [223]:
data.shape

(20640, 10)

In [224]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20640 non-null  float64
 1   latitude            20640 non-null  float64
 2   housing_median_age  20640 non-null  float64
 3   total_rooms         20640 non-null  float64
 4   total_bedrooms      20433 non-null  float64
 5   population          20640 non-null  float64
 6   households          20640 non-null  float64
 7   median_income       20640 non-null  float64
 8   median_house_value  20640 non-null  float64
 9   ocean_proximity     20640 non-null  object
dtypes: float64(9), object(1)
memory usage: 1.6+ MB

In [225]:
data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY

In [226]:
type(data)

pandas.core.frame.DataFrame

In [227]:
## Exporting dataframe back to csv

data.to_csv('housing_dataset', index=False)

In [229]:
## Exporting CSV to Excel

data.to_excel('housing_excel.xlsx', index=False)

In [230]:
## Reading the Excel file back

excel_data = pd.read_excel('housing_excel.xlsx')

In [231]:
excel_data.head()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity
0,-122.23,37.88,41,880,129.0,322,126,8.3252,452600,NEAR BAY
1,-122.22,37.86,21,7099,1106.0,2401,1138,8.3014,358500,NEAR BAY
2,-122.24,37.85,52,1467,190.0,496,177,7.2574,352100,NEAR BAY
3,-122.25,37.85,52,1274,235.0,558,219,5.6431,341300,NEAR BAY
4,-122.25,37.85,52,1627,280.0,565,259,3.8462,342200,NEAR BAY

## Real World: Exploratory Data Analysis (EDA)
All above was the basics. Let us apply some of these techniques to the real world dataset, Red wine quality.

In [232]:
wine_data = pd.read_csv('winequality-red.csv')

In [233]:
# Print the head of the data

wine_data.head()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
0,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5
1,7.8,0.88,0.00,2.6,0.098,25.0,67.0,0.9968,3.20,0.68,9.8,5
2,7.8,0.76,0.04,2.3,0.092,15.0,54.0,0.9970,3.26,0.65,9.8,5
3,11.2,0.28,0.56,1.9,0.075,17.0,60.0,0.9980,3.16,0.58,9.8,6
4,7.4,0.70,0.00,1.9,0.076,11.0,34.0,0.9978,3.51,0.56,9.4,5

In [234]:
# Print the tail of the data

wine_data.tail()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1594,6.2,0.600,0.08,2.0,0.090,32.0,44.0,0.99490,3.45,0.58,10.5,5
1595,5.9,0.550,0.10,2.2,0.062,39.0,51.0,0.99512,3.52,0.76,11.2,6
1596,6.3,0.510,0.13,2.3,0.076,29.0,40.0,0.99574,3.42,0.75,11.0,6
1597,5.9,0.645,0.12,2.0,0.075,32.0,44.0,0.99547,3.57,0.71,10.2,5
1598,6.0,0.310,0.47,3.6,0.067,18.0,42.0,0.99549,3.39,0.66,11.0,6

In [235]:
# Print the info about the data

wine_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1599 entries, 0 to 1598
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   fixed acidity         1599 non-null   float64
 1   volatile acidity      1599 non-null   float64
 2   citric acid           1599 non-null   float64
 3   residual sugar        1599 non-null   float64
 4   chlorides             1599 non-null   float64
 5   free sulfur dioxide   1599 non-null   float64
 6   total sulfur dioxide  1599 non-null   float64
 7   density               1599 non-null   float64
 8   pH                    1599 non-null   float64
 9   sulphates             1599 non-null   float64
 10  alcohol               1599 non-null   float64
 11  quality               1599 non-null   int64
dtypes: float64(11), int64(1)
memory usage: 150.0 KB

In [236]:
# print the summary of the data

wine_data.describe()

,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
count,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000,1599.000000
mean,8.319637,0.527821,0.270976,2.538806,0.087467,15.874922,46.467792,0.996747,3.311113,0.658149,10.422983,5.636023
std,1.741096,0.179060,0.194801,1.409928,0.047065,10.460157,32.895324,0.001887,0.154386,0.169507,1.065668,0.807569
min,4.600000,0.120000,0.000000,0.900000,0.012000,1.000000,6.000000,0.990070,2.740000,0.330000,8.400000,3.000000
25%,7.100000,0.390000,0.090000,1.900000,0.070000,7.000000,22.000000,0.995600,3.210000,0.550000,9.500000,5.000000
50%,7.900000,0.520000,0.260000,2.200000,0.079000,14.000000,38.000000,0.996750,3.310000,0.620000,10.200000,6.000000
75%,9.200000,0.640000,0.420000,2.600000,0.090000,21.000000,62.000000,0.997835,3.400000,0.730000,11.100000,6.000000
max,15.900000,1.580000,1.000000,15.500000,0.611000,72.000000,289.000000,1.003690,4.010000,2.000000,14.900000,8.000000

In [237]:
wine_data.describe().transpose()

,count,mean,std,min,25%,50%,75%,max
fixed acidity,1599.0,8.319637,1.741096,4.60000,7.1000,7.90000,9.200000,15.90000
volatile acidity,1599.0,0.527821,0.179060,0.12000,0.3900,0.52000,0.640000,1.58000
citric acid,1599.0,0.270976,0.194801,0.00000,0.0900,0.26000,0.420000,1.00000
residual sugar,1599.0,2.538806,1.409928,0.90000,1.9000,2.20000,2.600000,15.50000
chlorides,1599.0,0.087467,0.047065,0.01200,0.0700,0.07900,0.090000,0.61100
free sulfur dioxide,1599.0,15.874922,10.460157,1.00000,7.0000,14.00000,21.000000,72.00000
total sulfur dioxide,1599.0,46.467792,32.895324,6.00000,22.0000,38.00000,62.000000,289.00000
density,1599.0,0.996747,0.001887,0.99007,0.9956,0.99675,0.997835,1.00369
pH,1599.0,3.311113,0.154386,2.74000,3.2100,3.31000,3.400000,4.01000
sulphates,1599.0,0.658149,0.169507,0.33000,0.5500,0.62000,0.730000,2.00000
alcohol,1599.0,10.422983,1.065668,8.40000,9.5000,10.20000,11.100000,14.90000
quality,1599.0,5.636023,0.807569,3.00000,5.0000,6.00000,6.000000,8.00000

In [238]:
# Print the shape of the data

wine_data.shape

(1599, 12)

In [239]:
# Print the number of rows

wine_data.shape[0]

1599

In [240]:
# print the number of columns

wine_data.shape[1]

12

In [241]:
# print the columns in the data

wine_data.columns

Index(['fixed acidity', 'volatile acidity', 'citric acid', 'residual sugar',
       'chlorides', 'free sulfur dioxide', 'total sulfur dioxide', 'density',
       'pH', 'sulphates', 'alcohol', 'quality'],
      dtype='object')

In [244]:
wine_data.keys()

Index(['fixed acidity', 'volatile acidity', 'citric acid', 'residual sugar',
       'chlorides', 'free sulfur dioxide', 'total sulfur dioxide', 'density',
       'pH', 'sulphates', 'alcohol', 'quality'],
      dtype='object')

In [246]:
# Find the missing values in the data

wine_data.isnull().sum()

fixed acidity           0
volatile acidity        0
citric acid             0
residual sugar          0
chlorides               0
free sulfur dioxide     0
total sulfur dioxide    0
density                 0
pH                      0
sulphates               0
alcohol                 0
quality                 0
dtype: int64

In [247]:
# wine quality range from 0 to 10. The higher the quality value, the good wine is

wine_data['quality'].value_counts()

5    681
6    638
7    199
4     53
8     18
3     10
Name: quality, dtype: int64

In [248]:
wine_data['quality'].unique()

array([5, 6, 7, 4, 8, 3], dtype=int64)

In [249]:
wine_data.groupby(['fixed acidity', 'volatile acidity', 'citric acid']).sum()

                                            residual sugar  chlorides  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                    2.1      0.054
4.7           0.600            0.17                    2.3      0.058
4.9           0.420            0.00                    2.1      0.048
5.0           0.380            0.01                    1.6      0.048
              0.400            0.50                    4.3      0.046
...                                                    ...        ...
15.0          0.210            0.44                    4.4      0.150
15.5          0.645            0.49                    8.4      0.190
15.6          0.645            0.49                    4.2      0.095
              0.685            0.76                    3.7      0.100
15.9          0.360            0.65                    7.5      0.096

                                            free sulfur dioxide  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         8.0
4.7           0.600            0.17                        17.0
4.9           0.420            0.00                        16.0
5.0           0.380            0.01                        26.0
              0.400            0.50                        29.0
...                                                         ...
15.0          0.210            0.44                        20.0
15.5          0.645            0.49                        20.0
15.6          0.645            0.49                        10.0
              0.685            0.76                         6.0
15.9          0.360            0.65                        22.0

                                            total sulfur dioxide  density  \
fixed acidity volatile acidity citric acid
4.6           0.520            0.15                         65.0  0.99340
4.7           0.600            0.17                        106.0  0.99320
4.9           0.420            0.00                         42.0  0.99154
5.0           0.380            0.01                         60.0  0.99084
              0.400            0.50                         80.0  0.99020
...                                                          ...      ...
15.0          0.210            0.44                         48.0  2.00010
15.5          0.645            0.49                         46.0  2.00630
15.6          0.645            0.49                         23.0  1.00315
              0.685            0.76                         43.0  1.00320
15.9          0.360            0.65                         71.0  0.99760

                                              pH  sulphates  alcohol  quality
fixed acidity volatile acidity citric acid
4.6           0.520            0.15         3.90       0.56     13.1        4
4.7           0.600            0.17         3.85       0.60     12.9        6
4.9           0.420            0.00         3.71       0.74     14.0        7
5.0           0.380            0.01         3.70       0.75     14.0        6
              0.400            0.50         3.49       0.66     13.6        6
...                                          ...        ...      ...      ...
15.0          0.210            0.44         6.14       1.68     18.4       14
15.5          0.645            0.49         5.84       1.48     22.2       10
15.6          0.645            0.49         2.92       0.74     11.1        5
              0.685            0.76         2.95       0.68     11.2        7
15.9          0.360            0.65         2.98       0.84     14.9        5

[1333 rows x 9 columns]

In [250]:
wine_data.groupby(['free sulfur dioxide', 'total sulfur dioxide']).sum()

                                          fixed acidity  volatile acidity  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                           18.2             0.440
                    44.0                            7.9             0.400
2.0                 45.0                            7.9             0.400
3.0                 6.0                            33.0             1.215
                    7.0                            25.8             1.520
...                                                 ...               ...
55.0                95.0                           20.4             1.080
57.0                135.0                           5.9             0.190
66.0                115.0                           6.9             0.630
68.0                124.0                          13.2             1.470
72.0                160.0                           5.9             0.290

                                          citric acid  residual sugar  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                         0.48             4.2
                    44.0                         0.29             1.8
2.0                 45.0                         0.30             1.8
3.0                 6.0                          1.38             5.0
                    7.0                          0.63             6.0
...                                               ...             ...
55.0                95.0                         0.74            30.8
57.0                135.0                        0.21             1.7
66.0                115.0                        0.33             6.7
68.0                124.0                        0.04            15.8
72.0                160.0                        0.25            13.4

                                          chlorides  density    pH  sulphates  \
free sulfur dioxide total sulfur dioxide
1.0                 28.0                      0.156  1.99800  6.82       1.74
                    44.0                      0.157  0.99730  3.30       0.92
2.0                 45.0                      0.157  0.99727  3.31       0.91
3.0                 6.0                       0.229  2.98892  9.53       1.93
                    7.0                       0.242  2.98210  9.63       1.50
...                                             ...      ...   ...        ...
55.0                95.0                      0.428  2.00738  6.36       1.54
57.0                135.0                     0.045  0.99341  3.32       0.44
66.0                115.0                     0.235  0.99787  3.22       0.56
68.0                124.0                     0.244  1.99880  6.94       1.06
72.0                160.0                     0.067  0.99721  3.33       0.54

                                          alcohol  quality
free sulfur dioxide total sulfur dioxide
1.0                 28.0                     20.6       12
                    44.0                      9.5        6
2.0                 45.0                      9.5        6
3.0                 6.0                      32.7       16
                    7.0                      35.6       18
...                                           ...      ...
55.0                95.0                     18.0       12
57.0                135.0                     9.5        5
66.0                115.0                     9.5        5
68.0                124.0                    19.8       10
72.0                160.0                    10.3        6

[870 rows x 10 columns]